app/controllers/a_accounts_controller.rb

  def login
    @a_user = Administrator.new
    # @a_user.loginname = params[:login_name]

    if request.post?
      @a_user = Administrator.find_by_login_name(params[:a_user][:login_name])
---
SELECT * FROM `administrators` WHERE (`administrators`.`login_name` = 'sysadmin') LIMIT 1