app/controllers/accounts_controller.rb

    def edit_account
      @user = Volunteer.find_by_v_id(session[:id])
---
SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 50)