app/controllers/accounts_controller.rb

SELECT `volunteers`.v_id FROM `volunteers` WHERE (`volunteers`.`email` = BINARY 'anli8013@interchange.ubc.ca' AND `volunteers`.v_id <> 50) LIMIT 1
UPDATE `volunteers` SET `updated_at` = '2010-03-27 23:17:21', `last_login` = '2010-03-27 23:17:18' WHERE `v_id` = 50
---
  def login
    @user = Volunteer.new
    @user.email = params[:email]

    if session[:id] != nil
      redirect_to :action => 'my_account'
    end

    if request.post?
      user = Volunteer.find_by_email(params[:user][:email])
      if user != nil
        user.last_login = Time.now
        user.save

UPDATE `volunteers` SET `emrg_contact_name` = 'Marianne', `updated_at` = '2010-03-27 23:51:05', `emrg_contact_relationship` = 'Mother' WHERE `v_id` = 50
---
  def edit_account
    if request.put?
      if @user.update_attributes(params[:volunteer])

SELECT `volunteers`.v_id FROM `volunteers` WHERE (`volunteers`.`email` = BINARY 'anli8013@interchange.ubc.ca' AND `volunteers`.v_id <> 50) LIMIT 1
UPDATE `volunteers` SET `updated_at` = '2010-03-27 23:49:16', `password` = '59d00d85d9592623ac6b53c6f68c83de1adf2338' WHERE `v_id` = 50
---
  def forgot_password
    if request.post?
      user = Volunteer.find_by_email(params[:user][:email])
      if user == nil
        flash[:message] = "Sorry we could not find an account associated with that email. Please register for an account first."
      else
        new_pass = random_string(10)
        user.password = hash(new_pass)
        user.save

SELECT * FROM `volunteers` WHERE (`volunteers`.`email` = 'anli8013@interchange.ubc.ca') LIMIT 1
---
  def redispatch_activation_code
    if request.post?
      user = Volunteer.find_by_email(params[:email])

SELECT * FROM `volunteers` WHERE (`volunteers`.`email` = 'anli8013@interchange.ubc.ca') LIMIT 1
UPDATE `volunteers` SET `updated_at` = '2010-03-28 03:40:50', `activated` = 1 WHERE `v_id` = 50
---
  def verify
    if request.post? || params[:email] && params[:activation_code]
      user = Volunteer.find_by_email(params[:email])
      if user != nil && user.activated
        flash[:message] = "Your account has already been activated."
        redirect_to :action => :login
      elsif user != nil && user.activation_code == params[:activation_code]
        user.update_attribute(:activated, true)

SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 50) LIMIT 1
UPDATE `volunteers` SET `updated_at` = '2010-03-27 23:52:01', `active_status` = 0 WHERE `v_id` = 50
---
  def deactivate_account
    user = Volunteer.find_by_v_id(session[:id])
    if user != nil
      user.active_status = 0
      user.save

SELECT `volunteers`.v_id FROM `volunteers` WHERE (`volunteers`.`email` = BINARY 'anli8013@interchange.ubc.ca' AND `volunteers`.v_id <> 50) LIMIT 1
UPDATE `volunteers` SET `updated_at` = '2010-03-27 23:52:31', `active_status` = 1 WHERE `v_id` = 50
---
  def reactivate_account
    if request.post?
      user = Volunteer.find_by_email(params[:user][:email])
      if user == nil
        flash[:message] = "Sorry we could not find an account associated with that email.  Please check your typing."
      elsif !user.active_status
        user.active_status = 1
        user.save