app/controllers/data_reports_controller.rb

  def volunteer_report

  	v_start = params[:v_start]
  	v_end = params[:v_end]

    @volunteers_all = Volunteer.all
---
SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 50)

  def projects_report
  	@projects = Project.all
  	file = File.new("reports/ProjectReport - "+Time.now.to_i.to_s+".txt", "w")
  	file.puts("Generated report for "+@projects.size.to_s+" projects")

  	@projects.each{ |p|

  		@self_reports = SelfReport.find(:all, :conditions => { :project_id => p.p_id })
  	    time_total = 0
  	    @self_reports.each{ |r| time_total = time_total + (r.end_time - r.start_time) }
  		time_total = time_total.to_f / 3600

  		@vols = SelfReport.find(:all, :select => 'DISTINCT volunteer_id', :conditions => { :project_id => p.p_id })
---
SELECT * FROM `projects`
SELECT * FROM `self_reports` WHERE (`self_reports`.`project_id` = 1)
SELECT DISTINCT volunteer_id FROM `self_reports` WHERE (`self_reports`.`project_id` = 1)