app/controllers/group_reports_controller.rb

  def index
    @group_reports = GroupReport.all
---
SELECT * FROM `group_reports`