app/controllers/orientations_controller.rb

SELECT * FROM `orientations`
---
  def index
    @orientations = Orientation.all

INSERT INTO `orientations` (`name`, `end_time`, `location`, `description`, `start_time`) VALUES('Test Orientation', '2010-03-28 16:30:00', 'Blah', 'Farm Friends', '2010-03-28 15:00:00')
---
  def create

    @orientation = Orientation.new(params[:orientation])

    if @orientation.save

SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 50) LIMIT 1
SELECT * FROM `orientations` WHERE (`orientations`.`o_id` = 8) LIMIT 1
SELECT * FROM `volunteers_orientations` WHERE (`volunteers_orientations`.`volunteer_id` = 50)
---
  def v_orientations
    user = Volunteer.find_by_v_id(session[:id])
    if user != nil
        @volunteers_orientations = VolunteersOrientation.find(:all, :conditions => { :volunteer_id => user.v_id })

SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 50) LIMIT 1
SELECT * FROM `volunteers_orientations` WHERE (`volunteers_orientations`.`volunteer_id` = 50)
SELECT * FROM `orientations`
---
  def v_register
    user = Volunteer.find_by_v_id(session[:id])
    if user != nil

    	# Find all orientations that volunteer is registered in
        @volunteers_orientations = VolunteersOrientation.find(:all, :conditions => { :volunteer_id => user.v_id })

        # Get all orientations
        @orientations_all = Orientation.all

SELECT * FROM `orientations` WHERE (`orientations`.`o_id` = '8') LIMIT 1
INSERT INTO `volunteers_orientations` (`orientation_id`, `volunteer_id`, `attended`) VALUES(8, 50, 0)
---
  def v_add_orientation
  	orientation = Orientation.find_by_o_id(params[:orien])

  	@orien_vol = VolunteersOrientation.new
  	@orien_vol.volunteer_id = session[:id]
  	@orien_vol.orientation_id = params[:orien]
  	@orien_vol.attended = false

  	if @orien_vol.save

SELECT * FROM `volunteers_orientations` WHERE (`volunteers_orientations`.`orientation_id` = '8' AND `volunteers_orientations`.`volunteer_id` = '50') LIMIT 1
---
  def v_cancle

  	@vo = VolunteersOrientation.find_by_orientation_id_and_volunteer_id(params[:o_id], params[:v_id])

SELECT * FROM `orientations` WHERE (`orientations`.`o_id` = 1)
SELECT * FROM `volunteers_orientations` WHERE (`volunteers_orientations`.`orientation_id` = '1')
SELECT * FROM `volunteers`
---
  def showAttendees
	@orientation = Orientation.find(params[:id])
	@attendees = VolunteersOrientation.find(:all, :conditions => {:orientation_id => params[:id]})
	@volunteers = Volunteer.all