app/controllers/projects_controller.rb

  def index
    user = Volunteer.find_by_v_id(session[:id])
    if user != nil
        @volunteers_projects = VolunteersProjects.find(:all, :conditions => { :volunteer_id => user.v_id })
---
SELECT * FROM `projects` WHERE (`projects`.`p_id` = '1') LIMIT 1
SELECT * FROM `volunteers_projects` WHERE (`volunteers_projects`.`volunteer_id` = 51)

  def join
  	project = Project.find_by_p_id(params[:project])

  	@vp = VolunteersProjects.new
  	@vp.volunteer_id = session[:id]
  	@vp.project_id = params[:project]

  	 if @vp.save
---
INSERT INTO `volunteers_projects` (`project_id`, `volunteer_id`) VALUES (1, 50)