app/controllers/projects_controller.rb

SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 50) LIMIT 1
---
  def index
    user = Volunteer.find_by_v_id(session[:id])

SELECT * FROM `projects` WHERE (`projects`.`p_id` = '1') LIMIT 1
---
  def provide_feedback
    begin
      @project = Project.find_by_p_id(params[:id])

SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 50) LIMIT 1
SELECT * FROM `projects`
SELECT * FROM `projects` INNER JOIN `volunteers_projects` ON `projects`.p_id = `volunteers_projects`.project_id WHERE (`volunteers_projects`.volunteer_id = 50 )
---
  def join_projects
    user = Volunteer.find_by_v_id(session[:id])
    if user != nil
      # Find all projects that the volunteer joined
      @volunteers_projects = user.projects

      # Get all projects
      @projects = Project.all

      # Array to hold the projects that the volunteer has joined
      @projects_view = Array.new

      # For all projects check if the volunteer has joined it or not
      @projects.each { |p|

        # Variable to hold whether this project is already joined by volunteer, default = false
        is_registered = false

        # Check to see if project is already joined, if so, is_registered turns true
        @volunteers_projects.each { |vp|

SELECT * FROM `projects` WHERE (`projects`.`p_id` = '1') LIMIT 1
SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 50) LIMIT 1
---
  def join
    project = Project.find_by_p_id(params[:project])
    user = Volunteer.find_by_v_id(session[:id])

SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 50) LIMIT 1
SELECT * FROM `projects` WHERE (`projects`.`p_id` = '1') LIMIT 1
---
  def leave
    user = Volunteer.find_by_v_id(session[:id])
    user.projects.delete(Project.find_by_p_id(params[:p_id]))