app/controllers/reward_profiles_controller.rb

  def index
    @reward_profiles = RewardProfile.all
---
SELECT * FROM `reward_profiles`

  def create
    @reward_profile = RewardProfile.new(params[:reward_profile])

    respond_to do |format|
      if @reward_profile.save
---
INSERT INTO `reward_profiles` (`Name`, `RPid`, `Description`) VALUES('Test profile', 1, 'No reward')

   def s_showRewards
	@reward_profile = RewardProfile.find(params[:id])

	@rewards = Reward.find(:all, :conditions => {:RPid => params[:id]})
---
SELECT * FROM `rewards` WHERE (`rewards`.`RPid` = '1')