app/controllers/rewards_controller.rb

  def index
    @rewards = Reward.all
---
SELECT * FROM `rewards`

  def show
    @reward = Reward.find(params[:id])
---
SELECT * FROM `rewards` WHERE (`rewards`.`Rid` = 1)

  def create
    @reward = Reward.new(params[:reward])

    respond_to do |format|
      if @reward.save
---
INSERT INTO `rewards` (`Name`, `RPid`, `Description`, `Hours`) VALUES('reward', 1, 'T-Shirt', 5)

  def destroy
    @reward = Reward.find(params[:id])
    @reward.destroy
---
SELECT * FROM `rewards` WHERE (`rewards`.`Rid` = 1)
DELETE FROM `rewards` WHERE `Rid` = 1