app/controllers/s_accounts_controller.rb

SELECT * FROM `supervisors` WHERE (`supervisors`.`login_name` = 'lame') LIMIT 1
---
  def login
    @s_user = Supervisor.new
    # @s_user.login_name = params[:login_name]

    if request.post?
      @s_user = Supervisor.find_by_login_name(params[:s_user][:login_name])

SELECT * FROM `self_reports` WHERE (`self_reports`.`verified` = 0 AND `self_reports`.`supervisor_id` IS NULL)
---
  def my_account
  #	@own_reports = SelfReport.all
  #	@own_reports = SelfReport.find_by_supervisor_id([params[:sid]])
	@own_reports = SelfReport.find(:all, :conditions => {:supervisor_id => session[:sid], :verified => false})

SELECT * FROM `self_reports` WHERE (`self_reports`.`r_id` = 14)
SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 51) LIMIT 1
DELETE FROM `self_reports` WHERE `r_id` = 59
---
  def reject_comment
  	if request.post?
  	  @s_report = SelfReport.find(params[:id])
      @v_user = Volunteer.find_by_v_id(@s_report.volunteer_id)
      @comment = params[:tempo][:comment]

        if @v_user == nil
      	  @s_report.destroy

SELECT * FROM `self_reports` WHERE (`self_reports`.`r_id` = 51)
SELECT * FROM `volunteers` WHERE (`volunteers`.`v_id` = 51) LIMIT 1
UPDATE `self_reports` SET `updated_at` = '2010-03-29 19:53:09', `start_time` = '2000-01-01 03:00:00', `end_time` = '2000-01-01 04:00:00', `project_id` = 5, `task_description` = 'zzzzzzzzzzzzzzz' WHERE `r_id` = 60
---
  def edit_reports
  	begin
      @temp_reports = SelfReport.find(params[:id])

    rescue
      flash[:error] = 'Report not found'
      redirect_to :action => :verify_reports
    end

      @v_use = Volunteer.find_by_v_id(@temp_reports.volunteer_id)
      if @v_use == nil
      	flash[:error] = 'Volunteer not found or currently not active'
        redirect_to :action => 'verify_reports'
      else

  		if request.post?
           @temp_reports.update_attributes(params[:self_report])

SELECT * FROM `self_reports` WHERE (`self_reports`.`r_id` = 3)
UPDATE `self_reports` SET `updated_at` = '2010-03-25 20:41:10', `verified` = 1 WHERE `r_id` = 3
---
  def accept
  	begin
  	  @s_report = SelfReport.find(params[:id])
  	  @s_report.verified = true
  	  @s_report.save

SELECT * FROM `self_reports` WHERE (`self_reports`.`verified` = 0 AND `self_reports`.`supervisor_id` = 1)
---
  def verify_reports
  #	@own_reports = SelfReport.all
  #	@own_reports = SelfReport.find_by_supervisor_id([params[:sid]])
	@own_reports = SelfReport.find(:all, :conditions => {:supervisor_id => session[:sid], :verified => false})

INSERT INTO `self_reports` (`end_time`, `created_at`, `project_id`, `updated_at`, `date`, `task_description`, `volunteer_id`, `supervisor_id`, `verified`, `start_time`) VALUES('2010-03-29 02:00:00', '2010-03-29 21:30:21', 1, '2010-03-29 21:30:21', '2010-03-29', 'hi', 51, 7, 0, '2010-03-29 01:00:00')
---
  def create_reports_volunteer
  	@tempo_report = SelfReport.new
    if request.post?

      @tempo_report.update_attributes(params[:self_report])
      @tempo_report.verified = true

        join_project()
        @tempo_report.save