app/controllers/s_accounts_controller.rb

  def delete
    begin
      @s_report = @own_reports.find(params[:id])
      @s_report.destroy
---
DELETE FROM `self_reports` WHERE `r_id` = 6