app/controllers/self_reports_controller.rb

  def create_report
    @report = SelfReport.new
    if request.post?
      @report = @user.self_reports.build(params[:self_report])
      if @report.save
---
INSERT INTO `self_reports` (`end_time`, `created_at`, `project_id`, `updated_at`, `date`, `task_description`, `volunteer_id`, `supervisor_id`, `verified`, `start_time`) VALUES('2010-03-27 17:00:00', '2010-03-28 00:51:16', 5, '2010-03-28 00:51:16', '2010-03-27', '', 50, 7, 0, '2010-03-27 03:00:00')

  def edit_report
    begin
      @report = @user.self_reports.find(params[:id])
    rescue
      flash[:error] = 'Report not found'
      redirect_to :action => :index
    end

    if request.put?
      if @report.update_attributes(params[:self_report])
---
SELECT * FROM `self_reports` WHERE (`self_reports`.`r_id` = 15 AND (`self_reports`.volunteer_id = 50))
UPDATE `self_reports` SET `updated_at` = '2010-03-28 00:51:53', `task_description` = 'Hello' WHERE `r_id` = 15

  def delete
    begin
      @report = @user.self_reports.find(params[:id])
      @report.destroy
---
SELECT * FROM `self_reports` WHERE (`self_reports`.`r_id` = 60 AND (`self_reports`.volunteer_id = 50))
DELETE FROM `self_reports` WHERE `r_id` = 60