app/controllers/volunteers_controller.rb

  def index
    @volunteers = Volunteer.all
---
SELECT * FROM `volunteers`

  def create
    @volunteer = Volunteer.new(params[:volunteer])
    @volunteer_extra = VolunteerExtra.new(params[:volunteer_extra])
    @student = Student.new(params[:student])

    respond_to do |format|
      if @volunteer.valid? & @volunteer_extra.valid? & @student.valid?
        Volunteer.transaction do
          @volunteer.save!
---
INSERT INTO `volunteer_extras` (`skill_construction`, `skill_computer`, `skill_farming`, `skill_art`, `how_heard_about_farm`, `skill_fundraising`, `foodsafe_level1`, `skill_music`, `how_often_volunteer`, `first_aid`, `foodsafe_level2`, `skills_and_knowledge`, `own_transportation`, `volunteer_id`, `why_volunteer`, `skill_sales`) VALUES(0, 0, 0, 0, 'a', 0, 0, 1, 'a', 1, 0, 'a', 1, 51, 'a', 0)
INSERT INTO `volunteers` (`address`, `contract_signed`, `created_at`, `location`, `special_consideration`, `last_login`, `updated_at`, `postal_code`, `activation_code`, `phone_home`, `emrg_contact_name`, `emrg_contact_relationship`, `emrg_contact_phone_work`, `phone_work`, `active_status`, `last_name`, `birthday`, `phone_cell`, `preferred_contact_method`, `activated`, `password`, `province`, `first_name`, `email`, `emrg_contact_phone_home`) VALUES('523-4829 Cambie St.', 0, '2010-03-28 05:10:13', 'Vancouver', '', '2010-03-24 19:16:38', '2010-03-28 05:10:13', 'V2Y3E6', 'fd4ccebb48f714db3219865bde61e298e64731ef', '111111111', 'Chad', 'Servant', '', '', 1, 'J', '1965-03-28', '', 0, 0, '123456', 'BC', 'J', 'jj871020@gmail.com', '2222222222')